frontend/models/HotelRoomType.php

   public static function getHotelRoomTypeList()
   {
       $models = HotelRoomType::find()->all();
---
SELECT * FROM `hotel_room_type`