frontend/models/Location.php

   public static function getLocationList()
   {
       $models = Location::find()->all();
---
SELECT * FROM `location`